/*--------------------------------文*件*信*息-----------------------------
* 文件名：  Delay.h
* 版　本：  v1.0
* 描  述：  100T双轴 整合后的版本
* 创建人：   
* 日  期：   
--------------------------------------------------------------------------
*当前版本:	v1.0
*修 改 人:
*日　  期:
----------------------------------修改履历--------------------------------
1、
2、
3、
4、
------------------------------------------------------------------------*/
#ifndef __DELAY_PRIVATE_H__
	
	#define __DELAY_PRIVATE_H__


	void delay500us(void);
	void delay_100us (void);
	void delay_ms_ (void);
	void delay_ms (U16 n);
 	void delay_cyc (U16 n);
	void delayxus(void);
    void delayforcon(void);
	void Delay_IIC();
	void Delay_IIC_Half();

#endif
//***********************************************************************/